-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: localhost    Database: bookshelfdb
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `author`
--

DROP TABLE IF EXISTS `author`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `author` (
  `idauthor` int NOT NULL AUTO_INCREMENT,
  `Author name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`idauthor`),
  KEY `fk_fautho_book_idx` (`Author name`,`idauthor`)
) ENGINE=InnoDB AUTO_INCREMENT=191 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `author`
--

LOCK TABLES `author` WRITE;
/*!40000 ALTER TABLE `author` DISABLE KEYS */;
INSERT INTO `author` VALUES (127,'Алан Алек­сандр Милн'),(187,'Алекс Хей­ли и Мал­колм Икс'),(120,'Алек­сис де Токвиль'),(37,'Альбер Камю'),(23,'Альфред Дёблин'),(88,'Антон Чехов'),(45,'Астрид Линдгрен'),(10,'Вальмики'),(11,'Вергилий'),(12,'Вирджиния Вулф'),(13,'Вирджиния Вулф'),(101,'Вир­джи­ния Вульф'),(118,'Вир­джи­ния Вульф'),(56,'Владимир Набоков'),(98,'Вла­ди­мир Набо­ков'),(14,'Вьяса'),(17,'Габриэль Гарсиа Маркес'),(18,'Габриэль Гарсиа Маркес'),(111,'Габ­ри­эль Гар­сия Мар­кес'),(177,'Ген­ри Адамс'),(172,'Ген­ри Мил­лер'),(33,'Генрик Ибсен'),(51,'Герман Мелвилл'),(102,'Гомер'),(22,'Гюнтер Грасс'),(82,'Гюстав Флобер'),(83,'Гюстав Флобер'),(136,'Гюстав Фло­бер'),(2,'Данте Алигьери'),(104,'Дан­те Али­гье­ри'),(25,'Дени Дидро'),(43,'Джакомо Леопарди'),(64,'Джалаладдин Руми'),(163,'Джеймс Бол­ду­ин'),(24,'Джеймс Джойс'),(66,'Джейн Остин'),(103,'Джейн Остин'),(109,'Дже­ром Д. Сэлин­джер'),(89,'Джеффри Чосер'),(135,'Джин Рис'),(7,'Джованни Боккаччо'),(41,'Джозеф Конрад'),(165,'Джо­зеф Конрад'),(183,'Джо­зеф Конрад'),(113,'Джо­зеф Хел­лер'),(167,'Джон Апдайк'),(182,'Джон Кейнс'),(185,'Джон Кеннет Гэл­б­рейт'),(130,'Джон Керу­ак'),(137,'Джон Мил­тон'),(115,'Джон Стейн­бек'),(126,'Джон Тол­ки­ен'),(70,'Джонатан Свифт'),(106,'Джо­на­тан Свифт'),(58,'Джордж Оруэлл'),(97,'Джордж Ору­элл'),(151,'Джордж Ору­элл'),(93,'Джордж Элиот'),(107,'Джордж Элиот'),(105,'Джоф­ф­ри Чосер'),(44,'Дорис Лессинг'),(154,'Дорис Лес­синг'),(46,'Дэвид Герберт Лоуренс'),(161,'Дэвид Лоуренс'),(173,'Дэши­ел Хэм­мет'),(31,'Еврипид'),(122,'Жан-Жак Рус­со'),(69,'Жозе Сарамаго'),(20,'Жуан Гимарайнс Роза'),(176,'Зиг­мунд Фрейд'),(180,'Ивлин Во'),(19,'Иоганн Вольфганг фон Гёте'),(32,'Итало Звево'),(36,'Калидаса'),(123,'Карл Маркс'),(160,'Кар­сон Мак­кал­лерс'),(148,'Кен Кизи'),(186,'Кеннет Грэм'),(128,'Клайв Лью­ис'),(15,'Кнут Гамсун'),(150,'Курт Вон­не­гут'),(78,'Лев Толстой'),(79,'Лев Толстой'),(80,'Лев Толстой'),(96,'Лев Тол­стой'),(138,'Лев Тол­стой'),(188,'Лит­тон Стре­чи'),(76,'Лоренс Стерн'),(47,'Лу Синь'),(71,'Луи-Фердинанд Селин'),(178,'Мао Цзе­дун'),(110,'Мар­га­рет Мит­челл'),(95,'Маргерит Юрсенар'),(77,'Марк Твен'),(144,'Марк Твен'),(61,'Марсель Пруст'),(155,'Мар­сель Пруст'),(72,'Мигель де Сервантес'),(52,'Мишель де Монтень'),(73,'Мурасаки Сикибу'),(146,'Мэри Шел­ли'),(50,'Нагиб Махфуз'),(171,'Ната­ни­эль Уэст'),(1,'Неизвестный автор'),(124,'Ник­ко­ло Макиа­вел­ли'),(21,'Николай Васильевич Гоголь'),(35,'Никос Казандзакис'),(117,'Олдос Хакс­ли'),(5,'Оноре де Бальзак'),(87,'Пауль Целан'),(57,'Публий Овидий Назон'),(94,'Ральф Эллисон'),(100,'Ральф Элли­сон'),(145,'Редь­ярд Кип­линг'),(156,'Рей­монд Чанд­лер'),(181,'Рей­чел Кар­сон'),(119,'Ричард Райт'),(159,'Роберт Грейвз'),(184,'Роберт Грей­вз'),(55,'Роберт Музиль'),(162,'Роберт Пенн Уор­рен'),(67,'Саади'),(65,'Салман Рушди'),(116,'Сал­ман Руш­ди'),(74,'Софокл'),(75,'Стендаль'),(6,'Сэмюэл Беккет'),(68,'Тайиб Салих'),(170,'Тео­дор Драй­зер'),(125,'Томас Гоббс'),(48,'Томас Манн'),(49,'Томас Манн'),(54,'Тони Моррисон'),(114,'Тони Мор­ри­сон'),(147,'Тони Мор­ри­сон'),(153,'Тру­ман Капо­те'),(175,'Уил­ла Кей­тер'),(152,'Уильям Гол­динг'),(179,'Уильям Джемс'),(134,'Уильям Дю Бойс'),(84,'Уильям Фолкнер'),(85,'Уильям Фолкнер'),(99,'Уильям Фолк­нер'),(133,'Уильям Фолк­нер'),(157,'Уильям Фолк­нер'),(90,'Уильям Шекспир'),(91,'Уильям Шекспир'),(92,'Уильям Шекспир'),(139,'Уильям Шекс­пир'),(140,'Уильям Шекс­пир'),(141,'Уильям Шекс­пир'),(142,'Уильям Шекс­пир'),(190,'Уин­стон Чер­чилль'),(81,'Уолт Уитмен'),(143,'Уолт Уит­мен'),(16,'Федерико Гарсиа Лорка'),(27,'Фёдор Достоевский'),(28,'Фёдор Достоевский'),(29,'Фёдор Достоевский'),(30,'Фёдор Достоевский'),(59,'Фернанду Пессоа'),(174,'Филип Пул­ман'),(169,'Филип Рот'),(62,'Франсуа Рабле'),(38,'Франц Кафка'),(39,'Франц Кафка'),(40,'Франц Кафка'),(112,'Фрэн­сис Скотт Фитц­д­же­ральд'),(42,'Халлдор Кильян Лакснесс'),(3,'Ханс Кристиан Андерсен'),(131,'Хар­пер Ли'),(8,'Хорхе Луис Борхес'),(63,'Хуан Рульфо'),(121,'Чарльз Дар­вин'),(26,'Чарльз Диккенс'),(4,'Чинуа Ачебе'),(108,'Чинуа Аче­бе'),(164,'Эдвин Уайт'),(60,'Эдгар Аллан По'),(168,'Эдит Уор­тон'),(129,'Эду­ард Фор­стер'),(166,'Эли Визель'),(189,'Элис Уокер'),(53,'Эльза Моранте'),(9,'Эмили Бронте'),(132,'Энто­ни Бер­джесс'),(86,'Эрнест Хемингуэй'),(149,'Эрнест Хемин­гу­эй'),(158,'Эрнест Хемин­гу­эй'),(34,'Ясунари Кавабата');
/*!40000 ALTER TABLE `author` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `book`
--

DROP TABLE IF EXISTS `book`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `book` (
  `idbook` int NOT NULL AUTO_INCREMENT,
  `book name` varchar(255) DEFAULT NULL,
  `publication date` varchar(255) DEFAULT NULL,
  `author_id` int NOT NULL,
  `style_id` int NOT NULL,
  `shelf_id` int NOT NULL,
  PRIMARY KEY (`idbook`,`author_id`,`style_id`),
  KEY `fk_books_shelf1_idx` (`shelf_id`),
  KEY `fk_books_author_idx` (`author_id`),
  KEY `fk_books_style1_idx` (`style_id`)
) ENGINE=InnoDB AUTO_INCREMENT=191 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book`
--

LOCK TABLES `book` WRITE;
/*!40000 ALTER TABLE `book` DISABLE KEYS */;
INSERT INTO `book` VALUES (1,'Тысяча и одна ночь','',0,0,0),(2,'Божественная комедия','',0,0,0),(3,'Сказки','',0,0,0),(4,'И пришло разрушение','1958',0,0,0),(5,'Отец Горио','1835',0,0,0),(6,'Трилогия','',0,0,0),(7,'Декамерон','',0,0,0),(8,'Вымыслы','',0,0,0),(9,'Грозовой перевал','1847',0,0,0),(10,'Рамаяна','',0,0,0),(11,'Энеида','',0,0,0),(12,'Миссис Дэллоуэй','1925',0,0,0),(13,'На маяк','1927',0,0,0),(14,'Махабхарата','',0,0,0),(15,'Голод','1890',0,0,0),(16,'Цыганское романсеро','1928',0,0,0),(17,'Сто лет одиночества','1967',0,0,0),(18,'Любовь во время чумы','1985',0,0,0),(19,'Фауст','1832',0,0,0),(20,'Тропы по большому сертану','1956',0,0,0),(21,'Мёртвые души','1842',0,0,0),(22,'Жестяной барабан','1959',0,0,0),(23,'Берлин Александрплац','1929',0,0,0),(24,'Улисс','1922',0,0,0),(25,'Жак-фаталист и его хозяин','1796',0,0,0),(26,'Большие надежды','1861',0,0,0),(27,'Преступление и наказание','1866',0,0,0),(28,'Идиот','1869',0,0,0),(29,'Бесы','1872',0,0,0),(30,'Братья Карамазовы','1880',0,0,0),(31,'Медея','',0,0,0),(32,'Самопознание Дзено','1923',0,0,0),(33,'Кукольный дом','1879',0,0,0),(34,'Стон горы','1954',0,0,0),(35,'Невероятные похождения Алексиса Зорбаса','1946',0,0,0),(36,'Шакунтала','',0,0,0),(37,'Посторонний','1942',0,0,0),(38,'Рассказы','1924',0,0,0),(39,'Процесс','1925',0,0,0),(40,'Замок','1926',0,0,0),(41,'Ностромо','1904',0,0,0),(42,'Самостоятельные люди','',0,0,0),(43,'Стихи','1818',0,0,0),(44,'Золотая тетрадь','1962',0,0,0),(45,'Пеппи Длинныйчулок','1945',0,0,0),(46,'Сыновья и любовники','1913',0,0,0),(47,'Записки сумасшедшего','1918',0,0,0),(48,'Будденброки','1901',0,0,0),(49,'Волшебная гора','1924',0,0,0),(50,'Предания нашей улицы','1959',0,0,0),(51,'Моби Дик','1851',0,0,0),(52,'Опыты','1595',0,0,0),(53,'История','1974',0,0,0),(54,'Возлюбленная','1987',0,0,0),(55,'Человек без свойств','',0,0,0),(56,'Лолита','1955',0,0,0),(57,'Метаморфозы','',0,0,0),(58,'1984','1949',0,0,0),(59,'Книга непокоя','',0,0,0),(60,'Рассказы','',0,0,0),(61,'В поисках утраченного времени','',0,0,0),(62,'Гаргантюа и Пантагрюэль','',0,0,0),(63,'Педро Парамо','1955',0,0,0),(64,'Маснави','',0,0,0),(65,'Дети полуночи','1981',0,0,0),(66,'Гордость и предубеждение','1813',0,0,0),(67,'Бустан','1257',0,0,0),(68,'Сезон паломничества на Север','1966',0,0,0),(69,'Слепота','1995',0,0,0),(70,'Путешествия Гулливера','1726',0,0,0),(71,'Путешествие на край ночи','1932',0,0,0),(72,'Хитроумный идальго Дон Кихот Ламанчский','',0,0,0),(73,'Повесть о блистательном принце Гэндзи','',0,0,0),(74,'Эдип-царь','',0,0,0),(75,'Красное и чёрное','1830',0,0,0),(76,'Жизнь и мнения джентльмена Тристрама Шенди','1760',0,0,0),(77,'Приключения Гекльберри Финна','1884',0,0,0),(78,'Война и мир','1869',0,0,0),(79,'Анна Каренина','1877',0,0,0),(80,'Смерть Ивана Ильича','1886',0,0,0),(81,'Листья травы','1855',0,0,0),(82,'Госпожа Бовари','1857',0,0,0),(83,'Воспитание чувств','1869',0,0,0),(84,'Авессалом-Авессалом!','1936',0,0,0),(85,'Шум и ярость','1929',0,0,0),(86,'Старик и море','1952',0,0,0),(87,'Стихотворения','1952',0,0,0),(88,'Рассказы','1886',0,0,0),(89,'Кентерберийские рассказы','',0,0,0),(90,'Гамлет','1603',0,0,0),(91,'Король Лир','1608',0,0,0),(92,'Отелло','1609',0,0,0),(93,'Мидлмарч','1871',0,0,0),(94,'Человек-невидимка','1952',0,0,0),(95,'Воспоминания Адриана','1951',0,0,0),(96,'Вой­на и мир','1869',0,0,0),(97,'1984','1949',0,0,0),(98,'Лоли­та','1955',0,0,0),(99,'Шум и ярость','1929',0,0,0),(100,'Неви­дим­ка','1952',0,0,0),(101,'К мая­ку','1927',0,0,0),(102,'Илли­а­да и Одис­сея','',0,0,0),(103,'Гор­дость и пред­убеж­де­ние','1813',0,0,0),(104,'Боже­ствен­ная коме­дия','1321',0,0,0),(105,'Кен­тер­бе­рий­ские рас­ска­зы','',0,0,0),(106,'Путе­ше­ст­вия Гул­ли­ве­ра','1726',0,0,0),(107,'Мид­дл­марч','1874',0,0,0),(108,'Рас­пад','1958',0,0,0),(109,'Над про­па­стью во ржи','1951',0,0,0),(110,'Уне­сён­ные вет­ром','1936',0,0,0),(111,'Сто лет оди­но­че­ства','1967',0,0,0),(112,'Вели­кий Гэтсби','1925',0,0,0),(113,'Улов­ка 22','1961',0,0,0),(114,'Воз­люб­лен­ная','1987',0,0,0),(115,'Гроз­дья гне­ва','1939',0,0,0),(116,'Дети полу­но­чи','1981',0,0,0),(117,'Див­ный новый мир','1932',0,0,0),(118,'Мис­сис Дэл­лоуэй','1925',0,0,0),(119,'Сын Аме­ри­ки','1940',0,0,0),(120,'Демо­кра­тия в Аме­ри­ке','1835',0,0,0),(121,'Про­ис­хож­де­ние видов','1859',0,0,0),(122,'Обще­ствен­ный дого­вор','1762',0,0,0),(123,'Капи­тал','1867',0,0,0),(124,'Госу­дарь','1532',0,0,0),(125,'Левиа­фан','1651',0,0,0),(126,'Вла­сте­лин колец','1954',0,0,0),(127,'Вин­ни-Пух','1926',0,0,0),(128,'Лев, кол­ду­нья и пла­тя­ной шкаф','1950',0,0,0),(129,'Поезд­ка в Индию','1924',0,0,0),(130,'В доро­ге','1957',0,0,0),(131,'Убить пере­смеш­ни­ка','1960',0,0,0),(132,'Завод­ной апель­син','1962',0,0,0),(133,'Свет в авгу­сте','1932',0,0,0),(134,'Души чёр­но­го наро­да','1903',0,0,0),(135,'Без­бреж­ное Сар­гас­со­во море','1966',0,0,0),(136,'Мадам Бова­ри','1857',0,0,0),(137,'Поте­рян­ный рай','1667',0,0,0),(138,'Анна Каре­ни­на','1877',0,0,0),(139,'Гам­лет','1603',0,0,0),(140,'Король Лир','1608',0,0,0),(141,'Отел­ло','1622',0,0,0),(142,'Соне­ты','1609',0,0,0),(143,'Листья тра­вы','1855',0,0,0),(144,'При­клю­че­ния Гекль­бер­ри Фин­на','1885',0,0,0),(145,'Ким','1901',0,0,0),(146,'Фран­кен­штейн','1818',0,0,0),(147,'Песнь Соло­мо­на','1977',0,0,0),(148,'Про­ле­тая над гнез­дом кукуш­ки','1962',0,0,0),(149,'По ком зво­нит коло­кол','1940',0,0,0),(150,'Бой­ня номер пять','1969',0,0,0),(151,'Скот­ный двор','1945',0,0,0),(152,'Пове­ли­тель мух','1954',0,0,0),(153,'Хлад­но­кров­ное убий­ство','1965',0,0,0),(154,'Золо­тая тет­радь','1962',0,0,0),(155,'В поис­ках поте­рян­но­го вре­ме­ни','1913',0,0,0),(156,'Боль­шой сон','1939',0,0,0),(157,'Когда я уми­ра­ла','1930',0,0,0),(158,'Фие­ста','1926',0,0,0),(159,'Я, Клав­дий','1934',0,0,0),(160,'Серд­це — оди­но­кий охот­ник','1940',0,0,0),(161,'Сыно­вья и любов­ни­ки','1913',0,0,0),(162,'И вся коро­лев­ская рать','1946',0,0,0),(163,'Иди, вещай с горы','1953',0,0,0),(164,'Пау­ти­на Шар­лот­ты','1952',0,0,0),(165,'Серд­це тьмы','1902',0,0,0),(166,'Ночь','1958',0,0,0),(167,'Кро­лик, беги','1960',0,0,0),(168,'Эпо­ха невин­но­сти','1920',0,0,0),(169,'Слу­чай порт­но­го','1969',0,0,0),(170,'Аме­ри­кан­ская тра­ге­дия','1925',0,0,0),(171,'День саран­чи','1939',0,0,0),(172,'Тро­пик рака','1934',0,0,0),(173,'Маль­тий­ский сокол','1930',0,0,0),(174,'Тём­ные нача­ла','1995',0,0,0),(175,'Смерть при­шла архи­епи­ско­пу','1927',0,0,0),(176,'Тол­ко­ва­ния снов','1900',0,0,0),(177,'Вос­пи­та­ние Ген­ри Адам­са','1918',0,0,0),(178,'Цитат­ник','1964',0,0,0),(179,'Мно­го­об­ра­зие рели­ги­оз­но­го опы­та','1902',0,0,0),(180,'Воз­вра­ще­ние в Брайдс­хед','1945',0,0,0),(181,'Без­молв­ная вес­на','1962',0,0,0),(182,'Общая тео­рия заня­то­сти, про­цен­та и денег','1936',0,0,0),(183,'Лорд Джим','1900',0,0,0),(184,'Про­стим­ся со всем этим','1929',0,0,0),(185,'Обще­ство изоби­лия','1958',0,0,0),(186,'Ветер в ивах','1908',0,0,0),(187,'Авто­био­гра­фия Мал­кол­ма Икс','1965',0,0,0),(188,'Выда­ю­щи­е­ся вик­то­ри­ан­цы','1918',0,0,0),(189,'Цвет пур­пур­ный','1982',0,0,0),(190,'Вто­рая миро­вая война','1948',0,0,0);
/*!40000 ALTER TABLE `book` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `shelf`
--

DROP TABLE IF EXISTS `shelf`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `shelf` (
  `idshelf` int NOT NULL AUTO_INCREMENT,
  `shelf number` varchar(255) DEFAULT NULL,
  `shelf location` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`idshelf`)
) ENGINE=InnoDB AUTO_INCREMENT=191 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `shelf`
--

LOCK TABLES `shelf` WRITE;
/*!40000 ALTER TABLE `shelf` DISABLE KEYS */;
INSERT INTO `shelf` VALUES (1,'1','Гостиная'),(2,'1','Гостиная'),(3,'1','Гостиная'),(4,'1','Гостиная'),(5,'1','Гостиная'),(6,'1','Гостиная'),(7,'1','Гостиная'),(8,'1','Гостиная'),(9,'1','Гостиная'),(10,'1','Гостиная'),(11,'1','Гостиная'),(12,'1','Гостиная'),(13,'1','Гостиная'),(14,'1','Гостиная'),(15,'1','Гостиная'),(16,'1','Гостиная'),(17,'1','Гостиная'),(18,'1','Гостиная'),(19,'1','Гостиная'),(20,'1','Гостиная'),(21,'1','Гостиная'),(22,'1','Гостиная'),(23,'1','Гостиная'),(24,'2','Спальня'),(25,'2','Спальня'),(26,'2','Спальня'),(27,'2','Спальня'),(28,'2','Спальня'),(29,'2','Спальня'),(30,'2','Спальня'),(31,'2','Спальня'),(32,'2','Спальня'),(33,'2','Спальня'),(34,'2','Спальня'),(35,'2','Спальня'),(36,'2','Спальня'),(37,'2','Спальня'),(38,'2','Спальня'),(39,'2','Спальня'),(40,'2','Спальня'),(41,'2','Спальня'),(42,'2','Спальня'),(43,'2','Спальня'),(44,'2','Спальня'),(45,'3','Гостиная'),(46,'3','Гостиная'),(47,'3','Гостиная'),(48,'3','Гостиная'),(49,'3','Гостиная'),(50,'3','Гостиная'),(51,'3','Гостиная'),(52,'3','Гостиная'),(53,'3','Гостиная'),(54,'3','Гостиная'),(55,'3','Гостиная'),(56,'3','Гостиная'),(57,'3','Гостиная'),(58,'3','Гостиная'),(59,'3','Гостиная'),(60,'3','Гостиная'),(61,'3','Гостиная'),(62,'3','Гостиная'),(63,'3','Гостиная'),(64,'3','Гостиная'),(65,'3','Гостиная'),(66,'3','Гостиная'),(67,'3','Гостиная'),(68,'3','Гостиная'),(69,'3','Гостиная'),(70,'3','Гостиная'),(71,'3','Гостиная'),(72,'3','Гостиная'),(73,'4','Рабочий кабинет'),(74,'4','Рабочий кабинет'),(75,'4','Рабочий кабинет'),(76,'4','Рабочий кабинет'),(77,'4','Рабочий кабинет'),(78,'4','Рабочий кабинет'),(79,'4','Рабочий кабинет'),(80,'4','Рабочий кабинет'),(81,'4','Рабочий кабинет'),(82,'4','Рабочий кабинет'),(83,'4','Рабочий кабинет'),(84,'4','Рабочий кабинет'),(85,'4','Рабочий кабинет'),(86,'4','Рабочий кабинет'),(87,'4','Рабочий кабинет'),(88,'4','Рабочий кабинет'),(89,'4','Рабочий кабинет'),(90,'4','Рабочий кабинет'),(91,'4','Рабочий кабинет'),(92,'4','Рабочий кабинет'),(93,'4','Рабочий кабинет'),(94,'4','Рабочий кабинет'),(95,'4','Рабочий кабинет'),(96,'4','Рабочий кабинет'),(97,'4','Рабочий кабинет'),(98,'4','Рабочий кабинет'),(99,'4','Рабочий кабинет'),(100,'4','Рабочий кабинет'),(101,'4','Рабочий кабинет'),(102,'4','Рабочий кабинет'),(103,'4','Рабочий кабинет'),(104,'4','Рабочий кабинет'),(105,'4','Рабочий кабинет'),(106,'4','Рабочий кабинет'),(107,'4','Рабочий кабинет'),(108,'4','Рабочий кабинет'),(109,'4','Рабочий кабинет'),(110,'4','Рабочий кабинет'),(111,'4','Рабочий кабинет'),(112,'4','Рабочий кабинет'),(113,'4','Рабочий кабинет'),(114,'4','Рабочий кабинет'),(115,'4','Рабочий кабинет'),(116,'4','Рабочий кабинет'),(117,'4','Рабочий кабинет'),(118,'4','Рабочий кабинет'),(119,'4','Рабочий кабинет'),(120,'4','Рабочий кабинет'),(121,'4','Рабочий кабинет'),(122,'4','Рабочий кабинет'),(123,'4','Рабочий кабинет'),(124,'4','Рабочий кабинет'),(125,'4','Рабочий кабинет'),(126,'4','Рабочий кабинет'),(127,'4','Рабочий кабинет'),(128,'4','Рабочий кабинет'),(129,'4','Рабочий кабинет'),(130,'4','Рабочий кабинет'),(131,'4','Рабочий кабинет'),(132,'4','Рабочий кабинет'),(133,'4','Рабочий кабинет'),(134,'4','Рабочий кабинет'),(135,'4','Рабочий кабинет'),(136,'1','Гостиная'),(137,'1','Гостиная'),(138,'1','Гостиная'),(139,'1','Гостиная'),(140,'1','Гостиная'),(141,'1','Гостиная'),(142,'1','Гостиная'),(143,'1','Гостиная'),(144,'1','Гостиная'),(145,'1','Гостиная'),(146,'1','Гостиная'),(147,'1','Гостиная'),(148,'1','Гостиная'),(149,'3','Гостиная'),(150,'3','Гостиная'),(151,'3','Гостиная'),(152,'3','Гостиная'),(153,'3','Гостиная'),(154,'3','Гостиная'),(155,'3','Гостиная'),(156,'3','Гостиная'),(157,'3','Гостиная'),(158,'3','Гостиная'),(159,'3','Гостиная'),(160,'3','Гостиная'),(161,'3','Гостиная'),(162,'3','Гостиная'),(163,'3','Гостиная'),(164,'3','Гостиная'),(165,'3','Гостиная'),(166,'3','Гостиная'),(167,'3','Гостиная'),(168,'3','Гостиная'),(169,'3','Гостиная'),(170,'2','Спальня'),(171,'2','Спальня'),(172,'2','Спальня'),(173,'2','Спальня'),(174,'2','Спальня'),(175,'2','Спальня'),(176,'2','Спальня'),(177,'2','Спальня'),(178,'2','Спальня'),(179,'2','Спальня'),(180,'2','Спальня'),(181,'2','Спальня'),(182,'2','Спальня'),(183,'2','Спальня'),(184,'2','Спальня'),(185,'2','Спальня'),(186,'2','Спальня'),(187,'2','Спальня'),(188,'2','Спальня'),(189,'2','Спальня'),(190,'2','Спальня');
/*!40000 ALTER TABLE `shelf` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `style`
--

DROP TABLE IF EXISTS `style`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `style` (
  `id` int NOT NULL AUTO_INCREMENT,
  `book style` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=381 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `style`
--

LOCK TABLES `style` WRITE;
/*!40000 ALTER TABLE `style` DISABLE KEYS */;
INSERT INTO `style` VALUES (1,'Сказки'),(2,'Поэма'),(3,''),(4,''),(5,''),(6,''),(7,''),(8,''),(9,''),(10,''),(11,''),(12,''),(13,''),(14,''),(15,''),(16,''),(17,''),(18,''),(19,''),(20,''),(21,''),(22,''),(23,''),(24,''),(25,''),(26,''),(27,'Роман'),(28,'Роман'),(29,'Роман'),(30,'Роман'),(31,''),(32,''),(33,''),(34,''),(35,''),(36,''),(37,''),(38,''),(39,''),(40,''),(41,''),(42,''),(43,''),(44,''),(45,''),(46,''),(47,''),(48,''),(49,''),(50,''),(51,''),(52,''),(53,''),(54,''),(55,''),(56,''),(57,''),(58,'Антиутопия'),(59,''),(60,''),(61,''),(62,''),(63,''),(64,''),(65,''),(66,''),(67,''),(68,''),(69,''),(70,''),(71,''),(72,'Роман'),(73,''),(74,''),(75,''),(76,''),(77,''),(78,'Роман'),(79,'Роман'),(80,'Роман'),(81,''),(82,''),(83,''),(84,''),(85,''),(86,''),(87,''),(88,''),(89,''),(90,'Поэма'),(91,'Поэма'),(92,'Поэма'),(93,''),(94,''),(95,''),(96,''),(97,''),(98,''),(99,''),(100,''),(101,''),(102,'Поэма'),(103,''),(104,''),(105,''),(106,''),(107,''),(108,''),(109,''),(110,''),(111,''),(112,''),(113,''),(114,''),(115,''),(116,''),(117,''),(118,''),(119,''),(120,''),(121,''),(122,''),(123,''),(124,''),(125,''),(126,''),(127,''),(128,''),(129,''),(130,''),(131,''),(132,''),(133,''),(134,''),(135,''),(136,''),(137,''),(138,''),(139,''),(140,''),(141,''),(142,''),(143,''),(144,''),(145,''),(146,''),(147,''),(148,''),(149,''),(150,''),(151,''),(152,''),(153,''),(154,''),(155,''),(156,''),(157,''),(158,''),(159,''),(160,''),(161,''),(162,''),(163,''),(164,''),(165,''),(166,''),(167,''),(168,''),(169,''),(170,''),(171,''),(172,''),(173,''),(174,''),(175,''),(176,''),(177,''),(178,''),(179,''),(180,''),(181,''),(182,''),(183,''),(184,''),(185,''),(186,''),(187,''),(188,''),(189,''),(190,''),(191,'Сказки'),(192,'Поэма'),(193,''),(194,''),(195,''),(196,''),(197,''),(198,''),(199,''),(200,''),(201,''),(202,''),(203,''),(204,''),(205,''),(206,''),(207,''),(208,''),(209,''),(210,''),(211,''),(212,''),(213,''),(214,''),(215,''),(216,''),(217,'Роман'),(218,'Роман'),(219,'Роман'),(220,'Роман'),(221,''),(222,''),(223,''),(224,''),(225,''),(226,''),(227,''),(228,''),(229,''),(230,''),(231,''),(232,''),(233,''),(234,''),(235,''),(236,''),(237,''),(238,''),(239,''),(240,''),(241,''),(242,''),(243,''),(244,''),(245,''),(246,''),(247,''),(248,'Антиутопия'),(249,''),(250,''),(251,''),(252,''),(253,''),(254,''),(255,''),(256,''),(257,''),(258,''),(259,''),(260,''),(261,''),(262,'Роман'),(263,''),(264,''),(265,''),(266,''),(267,''),(268,'Роман'),(269,'Роман'),(270,'Роман'),(271,''),(272,''),(273,''),(274,''),(275,''),(276,''),(277,''),(278,''),(279,''),(280,'Поэма'),(281,'Поэма'),(282,'Поэма'),(283,''),(284,''),(285,''),(286,''),(287,''),(288,''),(289,''),(290,''),(291,''),(292,'Поэма'),(293,''),(294,''),(295,''),(296,''),(297,''),(298,''),(299,''),(300,''),(301,''),(302,''),(303,''),(304,''),(305,''),(306,''),(307,''),(308,''),(309,''),(310,''),(311,''),(312,''),(313,''),(314,''),(315,''),(316,''),(317,''),(318,''),(319,''),(320,''),(321,''),(322,''),(323,''),(324,''),(325,''),(326,''),(327,''),(328,''),(329,''),(330,''),(331,''),(332,''),(333,''),(334,''),(335,''),(336,''),(337,''),(338,''),(339,''),(340,''),(341,''),(342,''),(343,''),(344,''),(345,''),(346,''),(347,''),(348,''),(349,''),(350,''),(351,''),(352,''),(353,''),(354,''),(355,''),(356,''),(357,''),(358,''),(359,''),(360,''),(361,''),(362,''),(363,''),(364,''),(365,''),(366,''),(367,''),(368,''),(369,''),(370,''),(371,''),(372,''),(373,''),(374,''),(375,''),(376,''),(377,''),(378,''),(379,''),(380,'');
/*!40000 ALTER TABLE `style` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-06-02 21:07:11
